In [1]:
import pandas as pd
dict={'name':['Hari','Narayana','Vasudeva','Madhava'],'yuga':['Sarva','Sarva','Dwapara','Dwapara']}

In [4]:
df=pd.DataFrame(dict)
df

       name     yuga
0      Hari    Sarva
1  Narayana    Sarva
2  Vasudeva  Dwapara
3   Madhava  Dwapara

to access columns name

In [9]:
df.columns

Index(['name', 'yuga'], dtype='object')

specify index explicitly

In [18]:
df=pd.DataFrame(dict,index=['one','two','three','four'])
df

           name     yuga
one        Hari    Sarva
two    Narayana    Sarva
three  Vasudeva  Dwapara
four    Madhava  Dwapara

index explicitly

In [19]:
df.index=['i','ii','iii','iiii']
df

          name     yuga
i         Hari    Sarva
ii    Narayana    Sarva
iii   Vasudeva  Dwapara
iiii   Madhava  Dwapara

In [25]:
df.index.name='Index'
df

           name     yuga
Index
i          Hari    Sarva
ii     Narayana    Sarva
iii    Vasudeva  Dwapara
iiii    Madhava  Dwapara

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, i to iiii
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   yuga    4 non-null      object
dtypes: object(2)
memory usage: 96.0+ bytes

In [30]:
df.describe()

        name   yuga
count      4      4
unique     4      2
top     Hari  Sarva
freq       1      2

In [37]:
df.nunique() # number unique to find number of values present in each co

name    4
yuga    2
dtype: int64

In [38]:
df['yuga'].nunique()

2

total elements

In [39]:
df.size

8

shape

In [40]:
df.shape

(4, 2)

datset from net

In [43]:
cofee=pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/warmup-data/coffee.csv')
cofee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

# pd.read_parquet()
# pd.read_csv()
# pd.read_excel()

showing or printing options

In [46]:
#cofee
#print(cofee)
display(cofee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [49]:
cofee.sample(6)

        Day Coffee Type  Units Sold
2   Tuesday    Espresso          30
0    Monday    Espresso          25
9    Friday       Latte          35
13   Sunday       Latte          35
3   Tuesday       Latte          20
12   Sunday    Espresso          45

access values

In [62]:
cofee.loc[1:5,['Day','Units Sold']]

         Day  Units Sold
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35
5  Wednesday          25

In [63]:
cofee.iloc[1:5,[0,2]]

         Day  Units Sold
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35

Changing values

In [64]:
cofee.iloc[1,2] = 0
cofee.head(3)

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte           0
2  Tuesday    Espresso          30

In [66]:
cofee.iloc[0:3,2]=0
cofee.head(3)

       Day Coffee Type  Units Sold
0   Monday    Espresso           0
1   Monday       Latte           0
2  Tuesday    Espresso           0

In [67]:
#cofee.at[0,'Day']
cofee.iat[0,0]

'Monday'

In [68]:
for ind,row in cofee.iterrows():
    print(ind,row,sep='\n')

0
Day              Monday
Coffee Type    Espresso
Units Sold            0
Name: 0, dtype: object
1
Day            Monday
Coffee Type     Latte
Units Sold          0
Name: 1, dtype: object
2
Day             Tuesday
Coffee Type    Espresso
Units Sold            0
Name: 2, dtype: object
3
Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object
4
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object
5
Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object
6
Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object
7
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object
8
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object
9
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object
10
Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object
11
Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object
12
Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object
13
Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object